#include "Interface.h"

WorkerManager::WorkerManager()
{}

//展示菜单
void WorkerManager::Show_Menu()
{
	cout << "******************************************************" << endl;
	cout << "*****春学期 C++与数据结构期末大作业--人事管理系统*****" << endl;
	cout << "************** 19市政工程 胡鸿昊 21912060 ************" << endl;
	cout << "*************** 1.新增职工信息 ***********************" << endl;
	cout << "*************** 2.删除离职职工 ***********************" << endl;
	cout << "*************** 3.查询职工信息 ***********************" << endl;
	cout << "*************** 4.打印职工信息 ***********************" << endl;
	cout << "*************** 5.清空管理系统 ***********************" << endl;
	cout << "*************** 6.退出管理系统 ***********************" << endl;
	cout << "*************** 7.保存职工信息 ***********************" << endl;
	cout << "*************** 8.读取职工信息 ***********************" << endl;
}
void WorkerManager::exitSystem()
{
	cout << "欢迎下次使用" << endl;
	system("pause");
	exit(0);
}

WorkerManager::~WorkerManager()
{

}